nxp-appcodehub/dm-lvgl-epaper-smartlabel-kw45/k32w148evk_wireless_uart_epaper_freertos/source/common/ble_conn_manager.c
/*! *********************************************************************************
 * \addtogroup BLE
 * @{
 ********************************************************************************** */
/*! *********************************************************************************
* Copyright 2016-2022 NXP
* All rights reserved.
*
* \file
*
* SPDX-License-Identifier: BSD-3-Clause
********************************************************************************** */

/************************************************************************************
*************************************************************************************
* Include
*************************************************************************************
************************************************************************************/
#include "ble_general.h"
#include "gap_types.h"
#include "gap_interface.h"
#include "ble_conn_manager.h"
#include "board.h"
#include "ble_config.h"
#include "fwk_platform.h"

#if (defined(gRepeatedAttempts_d) && (gRepeatedAttempts_d == 1U))
#include "fwk_timer_manager.h"
#endif /* gRepeatedAttempts_d */

#include "ble_config.h"
#include "fsl_component_mem_manager.h"
#include "fsl_component_panic.h"
#include "SecLib.h"

/************************************************************************************
 *************************************************************************************
 * Private macros
 *************************************************************************************
 ************************************************************************************/
#define BleConnManager_GetLocalIrk(pOut)   BleConnManager_GetLocalKey(0U, pOut);
#define BleConnManager_GetLocalCsrk(pOut)  BleConnManager_GetLocalKey(1U, pOut);
/************************************************************************************
*************************************************************************************
* Public memory declarations
*************************************************************************************
************************************************************************************/

#if defined(__CC_ARM)
/* These  definitions are used only by the demo applications which do not have
 * advertisement capabilities in order to fix Keil compilation errors.
 * All other demo applications use the definitions present in app_config.c file.
 */
gapAdvertisingData_t            gAppAdvertisingData __attribute__((weak));
gapScanResponseData_t           gAppScanRspData __attribute__((weak));
gapSmpKeys_t                    gSmpKeys __attribute__((weak));
gapScanningParameters_t         gScanParams __attribute__((weak));
gapAdvertisingParameters_t      gAdvParams __attribute__((weak));
#endif /* __CC_ARM */

/************************************************************************************
*************************************************************************************
* Private type definitions
*************************************************************************************
************************************************************************************/
typedef struct repeatedAttemptsDevice_tag
{
    bleDeviceAddress_t  address;
    uint16_t            baseTimeout;   /* seconds */
    uint16_t            remainingTime; /* seconds */
} repeatedAttemptsDevice_t;

/************************************************************************************
*************************************************************************************
* Private prototypes
*************************************************************************************
************************************************************************************/
#if (defined(gAppSecureMode_d) && (gAppSecureMode_d > 0U))
STATIC void BleConnManager_ManageLocalKeys(void);
#if (defined(gAppUsePairing_d) && (gAppUsePairing_d == 1U))
STATIC void BleConnManager_GetLocalKey(uint8_t id, uint8_t* pOut);
#endif /* gAppUsePairing_d */
#else
STATIC void BleConnManager_MCUInfoToSmpKeys(void);
#endif
STATIC void BleConnManager_DataLengthUpdateProcedure(deviceId_t peerDeviceId);
#if (defined(gAppUsePrivacy_d) && (gAppUsePrivacy_d == 1U)) && \
    (defined(gAppUseBonding_d) && (gAppUseBonding_d == 1U))
STATIC bleResult_t BleConnManager_ManagePrivacyInternal(bool_t bCheckNewBond);
#endif /* gAppUsePrivacy_d */

#if (defined(gRepeatedAttempts_d) && (gRepeatedAttempts_d == 1U))
STATIC bool_t   RepeatedAttempts_CheckRequest(bleDeviceAddress_t address);
STATIC void     RepeatedAttempts_LogAttempt
                (
                    gapPairingCompleteEvent_t *pEvent,
                    bleDeviceAddress_t        address
                );
STATIC void     RepeatedAttempts_UpdateTimePassed(uint16_t seconds);
STATIC uint16_t RepeatedAttempts_GetMinTimeToWait();
STATIC void     RepeatedAttempts_TimerCb(void *param);
#endif /* gRepeatedAttempts_d */

#if (defined(gAppUsePairing_d) && (gAppUsePairing_d == 1U))
STATIC void BleConnManager_GapPeripheralEventEvtKeyExchangeRequest
                (
                    deviceId_t peerDeviceId,
                    gapConnectionEvent_t* pConnectionEvent
                );
STATIC void BleConnManager_GapPeripheralEventEvtPairingComplete
                (
                    deviceId_t            peerDeviceId,
                    gapConnectionEvent_t* pConnectionEvent
                );
STATIC void BleConnManager_GapCentralEventEvtKeyExchangeRequest
                (
                    deviceId_t            peerDeviceId,
                    gapConnectionEvent_t* pConnectionEvent
                );
#endif
/************************************************************************************
*************************************************************************************
* Private memory declarations
*************************************************************************************
************************************************************************************/
static bleDeviceAddress_t   maBleDeviceAddress;
STATIC uint32_t             mSupportedFeatures;

#if (defined(gAppUseBonding_d) && (gAppUseBonding_d == 1U))
 /* The number of bonded devices. It is incremented each time a new bond is created,
    on 'gBondCreatedEvent_c' generic event. When a bond or all bonds are removed,
    this variable must be updated accordingly by the application, since there
    is no corresponding 'bond removed' event triggered by the LE Host Stack */
uint8_t gcBondedDevices = 0;
#if gAppUsePrivacy_d
STATIC uint8_t mcDevicesInResolvingList = 0; /*
                                              * Number of devices present in host
                                              * resolving list
                                              */
STATIC bool_t  mbPrivacyEnabled = FALSE;
STATIC bool_t  mHaveRandomAddress = FALSE;
STATIC bool_t  mSettingRandomAddressFromApplication = FALSE;
#endif /* gAppUsePrivacy_d */
#endif /* gAppUseBonding_d */

