nxp-appcodehub/dm-lvgl-epaper-smartlabel-kw45/k32w148evk_wireless_uart_epaper_freertos/source/common/ble_conn_manager.c
#if (defined(gAppUsePairing_d) && (gAppUsePairing_d == 1U))
static bleDeviceAddress_t   maPeerDeviceAddress;
#if gAppUseBonding_d
static bleAddressType_t     mPeerDeviceAddressType;
#endif /* gAppUseBonding_d */
STATIC uint8_t              mSuccessfulPairings;
STATIC uint8_t              mFailedPairings;
#endif /* gAppUsePairing_d */

#if (defined(gRepeatedAttempts_d) && (gRepeatedAttempts_d == 1U))
repeatedAttemptsDevice_t    maPairingPeers[gRepeatedAttemptsNoOfDevices_c] = {0};
STATIC bleDeviceAddress_t   maPeerDeviceOriginalAddress;
STATIC tmrTimerID_t         mRepeatedAttemptsTimerId = gTmrInvalidTimerID_c;
STATIC uint16_t             mMinTimeToWait = 0;
#endif /* gRepeatedAttempts_d */

/************************************************************************************
*************************************************************************************
* Public functions
*************************************************************************************
************************************************************************************/

/*! *********************************************************************************
*\fn           void BleConnManager_GenericEvent(gapGenericEvent_t* pGenericEvent)
*\brief        Performs common operations on the BLE stack on the generic callback.
*
*\param  [in]  pGenericEvent    GAP Generic event from the Host Stack.
*
*\retval       void.
********************************************************************************** */
void BleConnManager_GenericEvent(gapGenericEvent_t* pGenericEvent)
{
    switch (pGenericEvent->eventType)
    {
        case gInitializationComplete_c:
        {
            /* Save feature set */
            mSupportedFeatures =
                 pGenericEvent->eventData.initCompleteData.supportedFeatures;
#if (defined(gAppSecureMode_d) && (gAppSecureMode_d > 0U))
            BleConnManager_ManageLocalKeys();
#else
            BleConnManager_MCUInfoToSmpKeys();
#endif
        }
        break;

#if (defined(gAppUsePrivacy_d) && (gAppUsePrivacy_d == 1U)) && \
    (defined(gAppUseBonding_d) && (gAppUseBonding_d == 1U))

        case gRandomAddressSet_c:
        {
            mHaveRandomAddress = TRUE;
        }
        break;

        case gRandomAddressReady_c:
        {
            if ((FALSE == mHaveRandomAddress) &&
                (TRUE == mSettingRandomAddressFromApplication))
            {
                mSettingRandomAddressFromApplication = FALSE;
                (void)Gap_SetRandomAddress(
                        pGenericEvent->eventData.addrReady.aAddress);
            }
        }
        break;

#endif /* gAppUseBonding_d && gAppUsePrivacy_d */

        case gPublicAddressRead_c:
        {
            /* Use address read from the controller */
            FLib_MemCpy(maBleDeviceAddress,
                        pGenericEvent->eventData.aAddress,
                        sizeof(bleDeviceAddress_t));
#if (defined(gAppUsePairing_d) && (gAppUsePairing_d == 1U))
            gSmpKeys.addressType = gBleAddrTypePublic_c;
            gSmpKeys.aAddress = maBleDeviceAddress;
#endif /* gAppUsePairing_d */
        }
        break;

#if (defined(gAppUsePairing_d) && (gAppUsePairing_d == 1U))
        case gLeScPublicKeyRegenerated_c:
        {
            /* Key pair regenerated -> reset pairing counters */
            mFailedPairings = mSuccessfulPairings = 0;
        }
        break;
#endif /* gAppUsePairing_d */

#if defined(gAppUseBonding_d) && (gAppUseBonding_d == 1U)
        case gBondCreatedEvent_c:
        {
            /*
             * Stack created a bond after pairing or at app
             * request, update global counter.
             */
            gcBondedDevices++;
        }
        break;

        /*
         * There is no event for bond removal. This action
         * is driven by the application and is synchronous,
         * so it is application's responsibility to update
         * gcBondedDevices if necessary.
         */
#endif /* gAppUseBonding_d */

#if (defined(gAppUsePrivacy_d) && (gAppUsePrivacy_d == 1U)) && \
    (defined(gAppUseBonding_d) && (gAppUseBonding_d == 1U))
#if defined(gBleEnableControllerPrivacy_d) && \
    (gBleEnableControllerPrivacy_d > 0)
        case gControllerPrivacyStateChanged_c:
        {
            /*
             * If controller privacy has been disabled,
             * set a new random address when it is
             * enabled again - IRK may have changed
             */
            if (pGenericEvent->eventData.newControllerPrivacyState ==
                FALSE)
            {
                mHaveRandomAddress = FALSE;
            }
        }
        break;
#endif /* gBleEnableControllerPrivacy_d */
#endif /* gAppUseBonding_d && gAppUsePrivacy_d */

        case gInternalError_c:
        {
            /*
             * This is a generic error which is triggered when a
             * dedicated error does not exist for the specific
             * problem. Treated below are some of the most
             * important error cases which could trigger an
             * internal error. Modify at need according to use
             * case. A list of all error codes and sources can
             * be found in ble_general.h - see bleResult_t and
             * gapInternalErrorSource_t enums. The error codes
             * for which panic is not triggered are not critical,
             * but are included here for awareness.
             */
            switch (pGenericEvent->eventData.internalError.errorCode)
            {
                /*
                 * An error occurred at the OS level.
                 * Host or Controller task creation
                 * or initialization failed.
                 */
                case gBleOsError_c: /*Fall Through*/
                /*
                 * A "should never get here"-type error.
                 * BLE Radio Init failed or an error occured
                 * when starting the next advertising event
                 * for the next SID while in
                 * Limited Discoverable Mode.
                 */
                case gBleUnexpectedError_c: /*Fall Through*/

