nxp-appcodehub/dm-lvgl-epaper-smartlabel-kw45/k32w148evk_wireless_uart_epaper_freertos/source/common/ble_conn_manager.c
                /*
                 * HCI layer initialization failure. HCI
                 * data buffering semaphore allocation error.
                 * HCI layer received an unknown packet type.
                 * Serial initialization or write failure.
                 */
                case gHciTransportError_c: /*Fall Through*/

                /*
                 * There is a problem with the internal
                 * state of the SM. This should not happen
                 *  during normal operations.
                 */
                case gSmInvalidInternalOperation_c: /*Fall Through*/

                /*
                 * Timer allocation failed.
                 * Consider increasing the number of timers
                 * in app_preinclude.h.
                 */
                case gBleTimerError_c:
                {
                    panic(0,0,0,0);
                }
                break;

                /*
                 * The Host has temporarily run out of buffers.
                 * This issue should be handled by the Host
                 * by freeing resources after data processing.
                 * If this error code persists on being received,
                 * consider modifying the buffer configuration
                 * in app_preinclude.h.
                 */
                case gBleOutOfMemory_c: /*Fall Through*/

                /* An internal limit is reached:
                 * L2CAP TX queue is full.
                 * This issue shouldbe handled by the Host
                 * by freeing resources after data processing.
                 * Exceeded the allowed number of connections.
                 * Consider updating gAppMaxConnections_c in
                 * app_preinclude.h according to hardware and
                 * use case.
                 */
                case gBleOverflow_c:
                {
                    ; /*
                       * For awareness only.
                       * No action required
                       */
                }
                break;

                default:
                {
                    ; /* No action required */
                }
                break;
            }
        }
        break;

        default:
        {
            ; /* No action required */
        }
        break;
    }
}

/*! *********************************************************************************
*\fn           void BleConnManager_GapPeripheralEvent(
*                  deviceId_t            peerDeviceId,
*                  gapConnectionEvent_t* pConnectionEvent)
*\brief        Performs GAP Peripheral operations on the BLE stack on the
*              connection callback.
*
*\param  [in]  peerDeviceId        The GAP peer Id.
*
*\param  [in]  pConnectionEvent    GAP Connection event from the Host Stack.
*
*\retval       void.
********************************************************************************** */
void BleConnManager_GapPeripheralEvent
(
    deviceId_t            peerDeviceId,
    gapConnectionEvent_t* pConnectionEvent
)
{
    switch (pConnectionEvent->eventType)
    {
        case gConnEvtConnected_c:
        {
#ifndef gCentralInitiatedPairing_d
#if (defined(gAppUsePairing_d) && (gAppUsePairing_d == 1U))
#if (defined(gRepeatedAttempts_d) && (gRepeatedAttempts_d == 1U))
            FLib_MemCpy(maPeerDeviceOriginalAddress,
                        pConnectionEvent->eventData.connectedEvent.peerAddress,
                        sizeof(bleDeviceAddress_t));
#endif /* gRepeatedAttempts_d */
#if (defined(gAppUseBonding_d) && (gAppUseBonding_d == 1U))
            bool_t isBonded = FALSE;
            uint8_t nvmIndex = gInvalidNvmIndex_c;

            /* Copy peer device address information */
            mPeerDeviceAddressType =
                      pConnectionEvent->eventData.connectedEvent.peerAddressType;
            FLib_MemCpy(maPeerDeviceAddress,
                        pConnectionEvent->eventData.connectedEvent.peerAddress,
                        sizeof(bleDeviceAddress_t));

            /*
             * Perform pairing if peer is not bonded or resolution procedure
             * for its address failed
             */
            if ((gBleSuccess_c == Gap_CheckIfBonded(peerDeviceId, &isBonded, &nvmIndex) &&
                FALSE == isBonded) ||
                (Ble_IsPrivateResolvableDeviceAddress(maPeerDeviceAddress) &&
                FALSE == pConnectionEvent->eventData.connectedEvent.peerRpaResolved))
#endif /* gAppUseBonding_d */
            {
                (void)Gap_SendPeripheralSecurityRequest(peerDeviceId, &gPairingParameters);
            }
#endif /* gAppUsePairing_d */
#endif /* gCentralInitiatedPairing_d */

#if gConnUpdateAlwaysAccept_d
            (void)Gap_EnableUpdateConnectionParameters(peerDeviceId, TRUE);
#endif /* gConnUpdateAlwaysAccept_d */

            /* Initiate Data Length Update Procedure */
            BleConnManager_DataLengthUpdateProcedure(peerDeviceId);

#if gConnInitiatePhyUpdateRequest_c
            if ((mSupportedFeatures & ((uint32_t)gLe2MbPhy_c |
                (uint32_t)gLeCodedPhy_c)) != 0U)
            {
                (void)Gap_LeSetPhy(FALSE,
                                   peerDeviceId,
                                   0,
                                   gConnPhyUpdateReqTxPhySettings_c,
                                   gConnPhyUpdateReqRxPhySettings_c,
                                   (uint16_t)gConnPhyUpdateReqPhyOptions_c);
            }
#endif /* gConnInitiatePhyUpdateRequest_c */
        }
        break;

        case gConnEvtPairingRequest_c:
        {
#if (defined(gAppUsePairing_d) && (gAppUsePairing_d == 1U))
            gPairingParameters.centralKeys =
                  pConnectionEvent->eventData.pairingEvent.centralKeys;
#if (defined(gRepeatedAttempts_d) && (gRepeatedAttempts_d == 1U))
            if (RepeatedAttempts_CheckRequest(maPeerDeviceOriginalAddress) == TRUE)
            {
                (void)Gap_AcceptPairingRequest(peerDeviceId,
                                               &gPairingParameters);
            }
            else
            {
                (void)Gap_RejectPairing(peerDeviceId,
                                        gRepeatedAttempts_c);
            }
#else  /* gRepeatedAttempts_d */
            (void)Gap_AcceptPairingRequest(peerDeviceId,
                                           &gPairingParameters);
#endif /* gRepeatedAttempts_d */
#else  /* gAppUsePairing_d */
            (void)Gap_RejectPairing(peerDeviceId,
                                    gPairingNotSupported_c);
#endif /* gAppUsePairing_d */
        }
        break;

