nxp-appcodehub/dm-lvgl-epaper-smartlabel-kw45/k32w148evk_wireless_uart_epaper_freertos/source/common/ble_conn_manager.c
#if (defined(gAppUsePairing_d) && (gAppUsePairing_d == 1U))

        case gConnEvtPasskeyRequest_c:
        {
            /* Depending on the IO capabilities, the peripheral may be required to input a passkey.
               The passkey should be read here, e.g., from UART/keyboard and passed to the stack by
               calling Gap_EnterPasskey */
               ;
        }
        break;

        case gConnEvtKeyExchangeRequest_c:
        {
            BleConnManager_GapPeripheralEventEvtKeyExchangeRequest(peerDeviceId, pConnectionEvent);
        }
        break;

        case gConnEvtKeysReceived_c:
        {
            /* Copy peer device address information when IRK is used */
            if (pConnectionEvent->eventData.keysReceivedEvent.pKeys->aIrk != NULL)
            {
#if gAppUseBonding_d
                mPeerDeviceAddressType =
                       pConnectionEvent->eventData.keysReceivedEvent.pKeys->addressType;
#endif /* gAppUseBonding_d */
                FLib_MemCpy(maPeerDeviceAddress,
                            pConnectionEvent->eventData.keysReceivedEvent.pKeys->aAddress,
                            sizeof(bleDeviceAddress_t));
            }
        }
        break;

        case gConnEvtPairingComplete_c:
        {
            BleConnManager_GapPeripheralEventEvtPairingComplete(peerDeviceId, pConnectionEvent);
        }
        break;

        case    gConnEvtLongTermKeyRequest_c:
        {
            if ((pConnectionEvent->eventData.longTermKeyRequestEvent.ediv == gSmpKeys.ediv) &&
                (pConnectionEvent->eventData.longTermKeyRequestEvent.randSize == gSmpKeys.cRandSize) &&
                (TRUE == FLib_MemCmp(pConnectionEvent->eventData.longTermKeyRequestEvent.aRand,
                                     gSmpKeys.aRand,
                                     gSmpKeys.cRandSize)))
            {
                /* EDIV and RAND both matched */
                (void)Gap_ProvideLongTermKey(peerDeviceId,
                                             gSmpKeys.aLtk,
                                             gSmpKeys.cLtkSize);
            }
            else
            /* EDIV or RAND size did not match */
            {
                (void)Gap_DenyLongTermKey(peerDeviceId);
            }
        }
        break;

        case gConnEvtLeScDisplayNumericValue_c:
        {
            (void) pConnectionEvent->eventData.numericValueForDisplay;
            /*
             * Display on a screen for user confirmation then
             * validate/invalidate based on value.
             */
            (void)Gap_LeScValidateNumericValue(peerDeviceId, TRUE);
        }
        break;

        case gConnEvtPairingNoLtk_c:
        {
#ifndef gCentralInitiatedPairing_d
            /* Peripheral does not have the LTK for peer Central.
             * Re-initiate pairing.
             */
            (void)Gap_SendPeripheralSecurityRequest(peerDeviceId,
                                               &gPairingParameters);
#endif /* gCentralInitiatedPairing_d */
        }
        break;

#endif /* gAppUsePairing_d */

        default:
        {
            ; /* No action required */
        }
        break;
    }
}

#if (defined(gAppUsePairing_d) && (gAppUsePairing_d == 1U))
/*! *********************************************************************************
*\private
*\fn           void BleConnManager_GapPeripheralEventEvtKeyExchangeRequest(
*                  deviceId_t            peerDeviceId,
*                  gapConnectionEvent_t* pConnectionEvent)
*\brief        Handles gConnEvtKeyExchangeRequest_c event from BleConnManager_GapPeripheralEvent.
*              This function is created so BleConnManager_GapPeripheralEvent can
*              respect the under 20 CCM metric. 
*
*\param  [in]  peerDeviceId        The GAP peer Id.
*
*\param  [in]  pConnectionEvent    GAP Connection event from the Host Stack.
*
*\retval       void.
********************************************************************************** */
STATIC void BleConnManager_GapPeripheralEventEvtKeyExchangeRequest
(
    deviceId_t            peerDeviceId,
    gapConnectionEvent_t* pConnectionEvent
)
{
    gapSmpKeys_t sentSmpKeys = gSmpKeys;
#if (defined(gAppSecureMode_d) && (gAppSecureMode_d > 0U))            
    uint8_t aIrk[gcSmpIrkSize_c];
    uint8_t aCsrk[gcSmpCsrkSize_c];
#endif
    if ((pConnectionEvent->eventData.keyExchangeRequestEvent.requestedKeys &
        (uint8_t)gLtk_c) == 0U)
    {
        sentSmpKeys.aLtk = NULL;
        /*
            * When the LTK is NULL EDIV and Rand are not sent
            * and will be ignored.
            */
    }

    if ((pConnectionEvent->eventData.keyExchangeRequestEvent.requestedKeys &
        (uint8_t)gIrk_c) == 0U)
    {
        sentSmpKeys.aIrk = NULL;
        /*
            * When the IRK is NULL the Address and Address Type
            * are not sent and will be ignored.
            */
    }
#if (defined(gAppSecureMode_d) && (gAppSecureMode_d > 0U))
    else
    {
        sentSmpKeys.aIrk = aIrk;
        BleConnManager_GetLocalIrk(sentSmpKeys.aIrk);
    }
#endif
    if ((pConnectionEvent->eventData.keyExchangeRequestEvent.requestedKeys &
        (uint8_t)gCsrk_c) == 0U)
    {
        sentSmpKeys.aCsrk = NULL;
    }
#if (defined(gAppSecureMode_d) && (gAppSecureMode_d > 0U))
    else
    {
        sentSmpKeys.aCsrk = aCsrk;
        BleConnManager_GetLocalCsrk(sentSmpKeys.aCsrk);
    }
#endif
    (void)Gap_SendSmpKeys(peerDeviceId, &sentSmpKeys);
}

/*! *********************************************************************************
*\private
*\fn           void BleConnManager_GapPeripheralEventEvtPairingComplete(
*                  deviceId_t            peerDeviceId,
*                  gapConnectionEvent_t* pConnectionEvent)
*\brief        Handles gConnEvtPairingComplete_c event from BleConnManager_GapPeripheralEvent.
*              This function is created so BleConnManager_GapPeripheralEvent can
*              respect the under 20 CCM metric. 
*
*\param  [in]  peerDeviceId        The GAP peer Id.
*
*\param  [in]  pConnectionEvent    GAP Connection event from the Host Stack.
*
*\retval       void.
********************************************************************************** */
STATIC void BleConnManager_GapPeripheralEventEvtPairingComplete
(
    deviceId_t            peerDeviceId,
    gapConnectionEvent_t* pConnectionEvent
)
{
#if (defined(gRepeatedAttempts_d) && (gRepeatedAttempts_d == 1U))
    RepeatedAttempts_LogAttempt(&pConnectionEvent->eventData.pairingCompleteEvent,
                                maPeerDeviceOriginalAddress);
#endif /* gRepeatedAttempts_d */
#if gAppUseBonding_d
    if (pConnectionEvent->eventData.pairingCompleteEvent.pairingSuccessful &&
        pConnectionEvent->eventData.pairingCompleteEvent.pairingCompleteData.withBonding)
    {
        /* If a bond is created, write device address in controller's Filter Accept List */
        (void)Gap_AddDeviceToFilterAcceptList(mPeerDeviceAddressType, maPeerDeviceAddress);
#if gAppUsePrivacy_d
        (void)BleConnManager_ManagePrivacyInternal(TRUE);
#endif /* gAppUsePrivacy_d */
    }
#endif /* gAppUseBonding_d */

    if (gPairingParameters.leSecureConnectionSupported)
    {
        pConnectionEvent->eventData.pairingCompleteEvent.pairingSuccessful ?
            mSuccessfulPairings++ : mFailedPairings++;

        /* Apply recommendations to change key pair after a number of attempts */
        if (((mFailedPairings * gConnPairFailToSucessCount_c) + mSuccessfulPairings) >
            gConnPairChangeKeyThreshold_d)
        {
            (void)Gap_LeScRegeneratePublicKey();
        }
    }
}
#endif /* gAppUsePairing_d */

/*! *********************************************************************************
*\fn           void BleConnManager_GapCentralEvent(
*                  deviceId_t            peerDeviceId,
*                  gapConnectionEvent_t* pConnectionEvent)
*\brief        Performs GAP Central operations on the BLE stack on the
*              connection callback.
*
*\param  [in]  peerDeviceId        The GAP peer Id.
*
*\param  [in]  pConnectionEvent    GAP Connection event from the Host Stack.
*
*\retval       void.
********************************************************************************** */
void BleConnManager_GapCentralEvent
(
    deviceId_t            peerDeviceId,
    gapConnectionEvent_t* pConnectionEvent
)
{
    switch (pConnectionEvent->eventType)
    {
        case gConnEvtConnected_c:
        {
#if (defined(gAppUsePairing_d) && (gAppUsePairing_d == 1U))
#if (defined(gRepeatedAttempts_d) && (gRepeatedAttempts_d == 1U))
            FLib_MemCpy(maPeerDeviceOriginalAddress,
                        pConnectionEvent->eventData.connectedEvent.peerAddress,
                        sizeof(bleDeviceAddress_t));
#endif /* gRepeatedAttempts_d */
#if (defined(gAppUseBonding_d) && (gAppUseBonding_d == 1U))
            /* Copy peer device address information */
            mPeerDeviceAddressType =
                    pConnectionEvent->eventData.connectedEvent.peerAddressType;
            FLib_MemCpy(maPeerDeviceAddress,
                        pConnectionEvent->eventData.connectedEvent.peerAddress,
                        sizeof(bleDeviceAddress_t));
#endif /* gAppUseBonding_d */
#endif /* gAppUsePairing_d */
#if gConnUpdateAlwaysAccept_d
            (void)Gap_EnableUpdateConnectionParameters(peerDeviceId, TRUE);
#endif /* gConnUpdateAlwaysAccept_d */
            /* Initiate Data Length Update Procedure */
            BleConnManager_DataLengthUpdateProcedure(peerDeviceId);
#if gConnInitiatePhyUpdateRequest_c
            if ((mSupportedFeatures & ((uint32_t)gLe2MbPhy_c |
                (uint32_t)gLeCodedPhy_c)) != 0U)
            {
                (void)Gap_LeSetPhy(FALSE,
                                   peerDeviceId,
                                   0,
                                   gConnPhyUpdateReqTxPhySettings_c,
                                   gConnPhyUpdateReqRxPhySettings_c,
                                   (uint16_t)gConnPhyUpdateReqPhyOptions_c);
            }
#endif /* gConnInitiatePhyUpdateRequest_c */
        }
        break;

        case gConnEvtParameterUpdateRequest_c:
        {
#if !gConnUpdateAlwaysAccept_d
            gapConnParamsUpdateReq_t *pUpdateReq =
                         &pConnectionEvent->eventData.connectionUpdateRequest;
            bool_t result;

            /* Check values match the configured intervals */
            result = (pUpdateReq->intervalMin > gConnUpdateIntervalMin_d) &&
                     (pUpdateReq->intervalMax < gConnUpdateIntervalMax_d) &&
                     (pUpdateReq->peripheralLatency > gConnUpdateLatencyMin_d) &&
                     (pUpdateReq->peripheralLatency < gConnUpdateLatencyMax_d) &&
                     (pUpdateReq->timeoutMultiplier > gConnUpdateSuperTimeoutMin_d) &&
                     (pUpdateReq->timeoutMultiplier < gConnUpdateSuperTimeoutMax_d);

