nxp-appcodehub/dm-lvgl-epaper-smartlabel-kw45/k32w148evk_wireless_uart_epaper_freertos/source/common/ble_conn_manager.c
            (void)Gap_EnableUpdateConnectionParameters(peerDeviceId, result);
#else  /* gConnUpdateAlwaysAccept_d */
            (void)Gap_EnableUpdateConnectionParameters(peerDeviceId, TRUE);
#endif /* gConnUpdateAlwaysAccept_d */
        }
        break;

        case gConnEvtPeripheralSecurityRequest_c:
        {
#if (defined(gAppUsePairing_d) && (gAppUsePairing_d == 1U))
            bool_t isBonded = FALSE;
            uint8_t nvmIndex = gInvalidNvmIndex_c;

            if ((gBleSuccess_c == Gap_CheckIfBonded(peerDeviceId, &isBonded, &nvmIndex)) &&
                (isBonded))
            {
                (void)Gap_EncryptLink(peerDeviceId);
            }
            else
            {
#if (defined(gRepeatedAttempts_d) && (gRepeatedAttempts_d == 1U))
                if (RepeatedAttempts_CheckRequest(maPeerDeviceOriginalAddress) == TRUE)
                {
                    (void)Gap_Pair(peerDeviceId, &gPairingParameters);
                }
                else
                {
                    (void)Gap_RejectPairing(peerDeviceId,
                                            gRepeatedAttempts_c);
                }
#else  /* gRepeatedAttempts_d */
                (void)Gap_Pair(peerDeviceId, &gPairingParameters);
#endif /* gRepeatedAttempts_d */
            }
#else  /* gAppUsePairing_d */
            (void)Gap_RejectPairing(peerDeviceId,
                                    gPairingNotSupported_c);
#endif /* gAppUsePairing_d */
        }
        break;

#if (defined(gAppUsePairing_d) && (gAppUsePairing_d == 1U))
#if defined(gPasskeyValue_c)
        case gConnEvtPasskeyRequest_c:
            (void)Gap_EnterPasskey(peerDeviceId, gPasskeyValue_c);
            break;
#endif /* gPasskeyValue_c */

        case gConnEvtPasskeyDisplay_c:
        {
            ; /* Display on a screen or simply ignore */
        }
        break;

        case gConnEvtLeScDisplayNumericValue_c:
        {
            (void)pConnectionEvent->eventData.numericValueForDisplay;
            /*
             * Display on a screen for user confirmation then
             * validate/invalidate based on value.
             */
            (void)Gap_LeScValidateNumericValue(peerDeviceId, TRUE);
        }
        break;

        case gConnEvtKeyExchangeRequest_c:
        {
            BleConnManager_GapCentralEventEvtKeyExchangeRequest(peerDeviceId, pConnectionEvent);
        }
        break;

        case gConnEvtKeysReceived_c:
        {
            /* Copy peer device address information when IRK is used */
            if (pConnectionEvent->eventData.keysReceivedEvent.pKeys->aIrk != NULL)
            {
#if gAppUseBonding_d
                mPeerDeviceAddressType =
                         pConnectionEvent->eventData.keysReceivedEvent.pKeys->addressType;
#endif /* gAppUseBonding_d */
                FLib_MemCpy(maPeerDeviceAddress,
                            pConnectionEvent->eventData.keysReceivedEvent.pKeys->aAddress,
                            sizeof(bleDeviceAddress_t));
            }
        }
        break;

        case gConnEvtEncryptionChanged_c:
        {
            ; /* Display on a screen or simply ignore */
        }
        break;

        case gConnEvtPairingComplete_c:
        {
#if (defined(gRepeatedAttempts_d) && (gRepeatedAttempts_d == 1U))
            RepeatedAttempts_LogAttempt(&pConnectionEvent->eventData.pairingCompleteEvent,
                                        maPeerDeviceOriginalAddress);
#endif /* gRepeatedAttempts_d */
#if gAppUseBonding_d
            if (pConnectionEvent->eventData.pairingCompleteEvent.pairingSuccessful &&
                pConnectionEvent->eventData.pairingCompleteEvent.pairingCompleteData.withBonding)
            {
                /*
                * If a bond is created, write device address in
                 * controller's Filter Accept List
                 */
                (void)Gap_AddDeviceToFilterAcceptList(mPeerDeviceAddressType,
                                               maPeerDeviceAddress);
#if gAppUsePrivacy_d
                (void)BleConnManager_ManagePrivacyInternal(TRUE);
#endif /* gAppUsePrivacy_d */
            }

#endif /* gAppUseBonding_d */

            if (gPairingParameters.leSecureConnectionSupported)
            {
                pConnectionEvent->eventData.pairingCompleteEvent.pairingSuccessful ?
                    mSuccessfulPairings++ : mFailedPairings++;

                /* Apply recommendations to change key pair after a number of attempts */
                if ((mSuccessfulPairings + (gConnPairFailToSucessCount_c * mFailedPairings)) >
                    gConnPairChangeKeyThreshold_d)
                {
                    (void)Gap_LeScRegeneratePublicKey();
                }
            }
        }
        break;
#endif /* gAppUsePairing_d */

        default:
        {
            ; /* No action required */
        }
        break;
    }
}

#if (defined(gAppUsePairing_d) && (gAppUsePairing_d == 1U))
/*! *********************************************************************************
*\private
*\fn           void BleConnManager_GapCentralEventEvtKeyExchangeRequest(
*                  deviceId_t            peerDeviceId,
*                  gapConnectionEvent_t* pConnectionEvent)
*\brief        Handles gConnEvtKeyExchangeRequest_c event from BleConnManager_GapCentralEvent.
*              This function is created so BleConnManager_GapCentralEvent can
*              respect the under 20 CCM metric. 
*
*\param  [in]  peerDeviceId        The GAP peer Id.
*
*\param  [in]  pConnectionEvent    GAP Connection event from the Host Stack.
*
*\retval       void.
********************************************************************************** */
STATIC void BleConnManager_GapCentralEventEvtKeyExchangeRequest
(
    deviceId_t            peerDeviceId,
    gapConnectionEvent_t* pConnectionEvent
)
{
    gapSmpKeys_t sentSmpKeys = gSmpKeys;
#if (defined(gAppSecureMode_d) && (gAppSecureMode_d > 0U))            
    uint8_t aIrk[gcSmpIrkSize_c];
    uint8_t aCsrk[gcSmpCsrkSize_c];
#endif
    if ((pConnectionEvent->eventData.keyExchangeRequestEvent.requestedKeys &
        (uint8_t)gLtk_c) == 0U)
    {
        sentSmpKeys.aLtk = NULL;
        /*
            * When the LTK is NULL EDIV and Rand are not sent and will be
            * ignored.
            */
    }

    if ((pConnectionEvent->eventData.keyExchangeRequestEvent.requestedKeys &
        (uint8_t)gIrk_c) == 0U)
    {
        sentSmpKeys.aIrk = NULL;
        /*
            * When the IRK is NULL the Address and Address Type are not sent
            * and will be ignored.
            */
    }
#if (defined(gAppSecureMode_d) && (gAppSecureMode_d > 0U))
    else
    {
        sentSmpKeys.aIrk = aIrk;
        BleConnManager_GetLocalIrk(sentSmpKeys.aIrk);
    }
#endif
    if ((pConnectionEvent->eventData.keyExchangeRequestEvent.requestedKeys &
        (uint8_t)gCsrk_c) == 0U)
    {
        sentSmpKeys.aCsrk = NULL;
    }
#if (defined(gAppSecureMode_d) && (gAppSecureMode_d > 0U))
    else
    {
        sentSmpKeys.aCsrk = aCsrk;
        BleConnManager_GetLocalCsrk(sentSmpKeys.aCsrk);
    }
#endif
    (void)Gap_SendSmpKeys(peerDeviceId, &sentSmpKeys);
}
#endif /* gAppUsePairing_d */

/*! *********************************************************************************
*\fn           bleResult_t BleConnManager_EnablePrivacy(void)
*\brief        Checks bonding devices and enables controller/host privacy.
*
*\param  [in]  none.
*
*\return       bleResult_t    Result of the operation.
********************************************************************************** */
bleResult_t BleConnManager_EnablePrivacy(void)
{
#if (defined(gAppUsePrivacy_d) && (gAppUsePrivacy_d == 1U)) && \
    (defined(gAppUseBonding_d) && (gAppUseBonding_d == 1U))
    bleResult_t result = gBleSuccess_c;

