nxp-appcodehub/dm-lvgl-epaper-smartlabel-kw45/k32w148evk_wireless_uart_epaper_freertos/source/common/ble_conn_manager.c
    if( FALSE == mbPrivacyEnabled )
    {
        result = BleConnManager_ManagePrivacyInternal(FALSE);
    }

    return result;
#else  /* gAppUsePrivacy_d && gAppUseBonding_d */
    return gBleFeatureNotSupported_c;
#endif /* gAppUsePrivacy_d && gAppUseBonding_d */
}

/*! *********************************************************************************
*\fn           bleResult_t BleConnManager_DisablePrivacy(void)
*\brief        Checks enabled privacy and disables controller/host privacy.
*
*\param  [in]  none.
*
*\return       bleResult_t    Result of the operation.
********************************************************************************** */
bleResult_t BleConnManager_DisablePrivacy(void)
{
#if (defined(gAppUsePrivacy_d) && (gAppUsePrivacy_d == 1U)) && \
    (defined(gAppUseBonding_d) && (gAppUseBonding_d == 1U))
    bleResult_t result = gBleSuccess_c;

    if( mbPrivacyEnabled )
    {
#if defined(gBleEnableControllerPrivacy_d) && \
    (gBleEnableControllerPrivacy_d > 0)
        if( mcDevicesInResolvingList == 0U )
        {
            result = Gap_EnableHostPrivacy(FALSE, NULL);
        }
        else
        {
            result = Gap_EnableControllerPrivacy(FALSE,
                                                 NULL,
                                                 0,
                                                 NULL);
        }
#else  /* gBleEnableControllerPrivacy_d */
        result = Gap_EnableHostPrivacy(FALSE, NULL);
#endif /* gBleEnableControllerPrivacy_d */

        if( gBleSuccess_c == result )
        {
            mbPrivacyEnabled = FALSE;
        }
    }

    return result;
#else  /* gAppUsePrivacy_d && gAppUseBonding_d */
    return gBleFeatureNotSupported_c;
#endif /* gAppUsePrivacy_d && gAppUseBonding_d */
}

/*! *********************************************************************************
*\fn           void BleConnManager_GapCommonConfig(void)
*\brief        Performs common GAP configuration.
*
*\param  [in]  none.
*
*\retval       void.
********************************************************************************** */
void BleConnManager_GapCommonConfig(void)
{
    /* Read public address from controller */
    (void)Gap_ReadPublicDeviceAddress();

#if (defined(gAppUsePairing_d) && (gAppUsePairing_d == 1U))
    /* Register security requirements if pairing is used */
    (void)Gap_RegisterDeviceSecurityRequirements(&deviceSecurityRequirements);

#ifdef gPasskeyValue_c
    /*
     * Set local passkey. If not defined, passkey will be generated random in SMP.
     * Do not set local passkey if device IO capabilities are gIoKeyboardOnly_c.
     * It will need to be input during the pairing process.
     */
    if (gPairingParameters.localIoCapabilities != gIoKeyboardOnly_c)
    {
        (void)Gap_SetLocalPasskey(gPasskeyValue_c);
    }
#endif /* gPasskeyValue_c */

#endif /* gAppUsePairing_d */

    /* Populate Filter Accept List if bonding is supported */
#if (defined(gAppUseBonding_d) && (gAppUseBonding_d == 1U))
    gapIdentityInformation_t aIdentity[gMaxBondedDevices_c];
    bleResult_t result = Gap_GetBondedDevicesIdentityInformation(aIdentity,
                                                                 gMaxBondedDevices_c,
                                                                 &gcBondedDevices);

    if (gBleSuccess_c == result && gcBondedDevices > 0U)
    {
        for (uint8_t i = 0; i < gcBondedDevices; i++)
        {
            (void)Gap_AddDeviceToFilterAcceptList(aIdentity[i].identityAddress.idAddressType,
                                          aIdentity[i].identityAddress.idAddress);
        }
    }
#endif /* gAppUseBonding_d */

#if (defined(gAppUsePrivacy_d) && (gAppUsePrivacy_d == 1U))
#if (defined(gAppUseBonding_d) && (gAppUseBonding_d == 1U))
    (void)BleConnManager_ManagePrivacyInternal(FALSE);
#else /* gAppUseBonding_d */
    /* Use Non-Resolvable Private Addresses */
    (void)Gap_EnableHostPrivacy(TRUE, NULL);
#endif /* gAppUseBonding_d */
#endif /* gAppUsePrivacy_d */
    if ((mSupportedFeatures & ((uint32_t)gLe2MbPhy_c |
        (uint32_t)gLeCodedPhy_c)) != 0U)
    {
        (void)Gap_LeSetPhy(TRUE,
                           0,
                           0,
                           gConnDefaultTxPhySettings_c,
                           gConnDefaultRxPhySettings_c,
                           0);
    }
}

/************************************************************************************
*************************************************************************************
* Private functions
*************************************************************************************
************************************************************************************/
#if (defined(gAppSecureMode_d) && (gAppSecureMode_d > 0U))
#include "app_conn.h"
/*! *********************************************************************************
*\private
*\fn           void BleConnManager_ManageLocalKeys(void)
*\brief        Generates local IRK and CSRK and stores them in NVM.
*
*\param  [in]  none.
*
*\retval       void.
********************************************************************************** */
STATIC void BleConnManager_ManageLocalKeys(void)
{
    bleLocalKeysBlob_t localIrk = {0};
    bleLocalKeysBlob_t localCSRK = {0};
    bool_t lkFailure = TRUE;
    (void)App_NvmReadLocalIRK(&localIrk);
    (void)App_NvmReadLocalCSRK(&localCSRK);
    do
    {
        if(localIrk.keyGenerated == FALSE)
        {
            if(gSecSuccess_c != SecLib_GenerateSymmetricKey(gcSmpIrkSize_c, TRUE, localIrk.raw ))
            {
                break;
            }
            localIrk.keyGenerated = TRUE;
            if(gBleSuccess_c != App_NvmWriteLocalIRK(&localIrk))
            {
                break;
            }
        }
        if(gSecSuccess_c !=  SecLib_GenerateBluetoothEIRKBlob(localIrk.raw , TRUE, TRUE, gSmpKeys.aIrk))
        {
            break;
        }
        if(localCSRK.keyGenerated == FALSE)
        {
            if(gSecSuccess_c != SecLib_GenerateSymmetricKey(gcSmpCsrkSize_c, TRUE, localCSRK.raw ))
            {
                break;
            }
            localCSRK.keyGenerated = TRUE;
            if(gBleSuccess_c != App_NvmWriteLocalCSRK(&localCSRK))
            {
                break;
            }
        }
        lkFailure = FALSE;
#if (defined(gAppUsePairing_d) && (gAppUsePairing_d == 1U))
        gPairingParameters.securityModeAndLevel = gSecurityMode_1_Level_4_c;
        gPairingParameters.leSecureConnectionSupported = TRUE;
#endif /* gAppUsePairing_d */
    }
    while(FALSE);
    if(lkFailure)
    {
        panic(0,0,0,0);  
    }           
}

