nxp-appcodehub/dm-lvgl-epaper-smartlabel-kw45/k32w148evk_wireless_uart_epaper_freertos/source/common/ble_conn_manager.c
#if (defined(gAppUsePairing_d) && (gAppUsePairing_d == 1U))
/*! *********************************************************************************
*\private
*\fn           void BleConnManager_GetLocalKey(void)
*\brief        Reads local key blob from NVM and outputs the key in plain text.
*
*\param  [in]  id   - local key Entry Index 0/1 IRK/CSRK.
*
*\param  [out] pOut - the address of the buffer where the plain text key will de written.
*
*\retval       void.
********************************************************************************** */
STATIC void BleConnManager_GetLocalKey(uint8_t id, uint8_t* pOut)
{
    bleLocalKeysBlob_t localKey = {0};
    (void)App_NvmReadLocalKeys(id , &localKey);
    if(gSecSuccess_c !=  SecLib_DeobfuscateKey(localKey.pKey, pOut))
    {
        panic(0,0,0,0);  
    }
}
#endif /* gAppUsePairing_d */

#else /* (defined(gAppSecureMode_d) && (gAppSecureMode_d > 0U)) */
/*! *********************************************************************************
*\private
*\fn           void BleConnManager_MCUInfoToSmpKeys(void)
*\brief        Generates LTK, IRK, CSRK, ediv and rand.
*
*\param  [in]  none.
*
*\retval       void.
********************************************************************************** */
STATIC void BleConnManager_MCUInfoToSmpKeys(void)
{
    uint8_t uid[16] = {0};
    uint8_t len = 0;
    uint8_t sha256Output[SHA256_HASH_SIZE] = {0};

    PLATFORM_GetMCUUid (uid, &len);

    if(len > 0U)
    {
        /* generate LTK. LTK size always smaller than SHA1 hash size */
        uid[len - 1U]++;
        SHA256_Hash (uid, len, sha256Output);
        FLib_MemCpy (gSmpKeys.aLtk, sha256Output, gSmpKeys.cLtkSize);

#if (!defined(gUseCustomIRK_d) || (gUseCustomIRK_d == 0U))
        /* generate IRK */
        uid[len - 1U]++;
        SHA256_Hash (uid, len, sha256Output);
        FLib_MemCpy (gSmpKeys.aIrk, sha256Output, gcSmpIrkSize_c);
#endif /* gUseCustomIRK_d */

        /* generate CSRK */
        uid[len - 1U]++;
        SHA256_Hash (uid, len, sha256Output);
        FLib_MemCpy (gSmpKeys.aCsrk, sha256Output, gcSmpCsrkSize_c);

        /* generate ediv and rand */
        uid[len - 1U]++;
        SHA256_Hash (uid, len, sha256Output);
        gSmpKeys.ediv = (uint16_t)sha256Output[0];
        FLib_MemCpy (&(gSmpKeys.ediv),
                     &(sha256Output[0]),
                     sizeof(gSmpKeys.ediv));
        FLib_MemCpy (gSmpKeys.aRand,
                     &(sha256Output[sizeof(gSmpKeys.ediv)]),
                     gSmpKeys.cRandSize);
    }
}
#endif /* (defined(gAppSecureMode_d) && (gAppSecureMode_d > 0U)) */
/*! *********************************************************************************
*\private
*\fn           void BleConnManager_DataLengthUpdateProcedure(deviceId_t peerDeviceId)
*\brief        Initiates Data Length Update Procedure.
*
*\param  [in]  peerDeviceId    The GAP peer Id.
*
*\retval       void.
********************************************************************************** */
STATIC void BleConnManager_DataLengthUpdateProcedure(deviceId_t peerDeviceId)
{
    if ((mSupportedFeatures &
        (uint32_t)gLeDataPacketLengthExtension_c) != 0U)
    {
        /* Check for Coded PHY support */
        bool_t codedPhySupported = (mSupportedFeatures & (uint32_t)gLeCodedPhy_c) != 0U;

        (void)Gap_UpdateLeDataLength(peerDeviceId, gBleMaxTxOctets_c,
                                     codedPhySupported ?
                                     gBleMaxTxTimeCodedPhy_c : gBleMaxTxTime_c);
    }
}

#if (defined(gAppUsePrivacy_d) && (gAppUsePrivacy_d == 1U)) && \
    (defined(gAppUseBonding_d) && (gAppUseBonding_d == 1U))

/*! *********************************************************************************
*\private
*\fn           bleResult_t BleConnManager_ManagePrivacyInternal(bool_t bCheckNewBond)
*\brief        Manage privacy for host or controller based on the available bonding
*              information.
*
*\param  [in]  bCheckNewBond     Verify that the latest bonded device is new and
*                                requires a privacy list update.
*
*\return       bleResult_t       Result of the operation.
********************************************************************************** */
STATIC bleResult_t BleConnManager_ManagePrivacyInternal(bool_t bCheckNewBond)
{
    gapIdentityInformation_t *pOutIdentityAddresses = NULL;
    uint8_t                  identitiesCount = 0;
    bleResult_t              result = gBleSuccess_c;

    pOutIdentityAddresses =
          (gapIdentityInformation_t *)MEM_BufferAlloc(
                            (uint32_t)gMaxResolvingListSize_c *
                            sizeof(gapIdentityInformation_t));

    if( NULL != pOutIdentityAddresses )
    {
        uint8_t* pLocalIrk; 
#if (defined(gAppSecureMode_d) && (gAppSecureMode_d > 0U))    
        bleLocalKeysBlob_t localIrk = {0};
        (void)App_NvmReadLocalIRK(&localIrk);
        pLocalIrk = localIrk.pKey;
#else
        pLocalIrk = gSmpKeys.aIrk;
#endif        
        result = Gap_GetBondedDevicesIdentityInformation(pOutIdentityAddresses,
                                                         gMaxResolvingListSize_c,
                                                         &identitiesCount);

        if((gBleSuccess_c == result) && (identitiesCount > 0U ))
        {
            if ((identitiesCount == mcDevicesInResolvingList + 1U ) ||
                (bCheckNewBond == FALSE))
            {
                (void)BleConnManager_DisablePrivacy();

                mcDevicesInResolvingList = identitiesCount;

                if( mcDevicesInResolvingList > (uint8_t)gMaxResolvingListSize_c )
                {
                    mcDevicesInResolvingList = gMaxResolvingListSize_c;
                }

                if (FALSE == mHaveRandomAddress)
                {
                    mSettingRandomAddressFromApplication = TRUE;
                    (void)Gap_CreateRandomDeviceAddress(pLocalIrk, NULL);
                }
#if defined(gBleEnableControllerPrivacy_d) && (gBleEnableControllerPrivacy_d > 0)
                result = Gap_EnableControllerPrivacy(TRUE,
                                                     gSmpKeys.aIrk,
                                                     mcDevicesInResolvingList,
                                                     pOutIdentityAddresses);
#else  /* gBleEnableControllerPrivacy_d */
                result = Gap_EnableHostPrivacy(TRUE, pLocalIrk);
#endif /* gBleEnableControllerPrivacy_d */
            }
            else
            {
                /* This is not a new bond, leave privacy as is */
            }
        }
        else
        {
            result = Gap_EnableHostPrivacy(TRUE, pLocalIrk);
        }

        (void)MEM_BufferFree(pOutIdentityAddresses);

        if( gBleSuccess_c == result )
        {
            mbPrivacyEnabled = TRUE;
        }
    }
    else
    {
        result = gBleOutOfMemory_c;
    }

    return result;
}
#endif /* (gAppUsePrivacy_d) && (gAppUseBonding_d) */

#if (defined(gRepeatedAttempts_d) && (gRepeatedAttempts_d == 1U))

/*! *********************************************************************************
*\private
*\fn           bool_t RepeatedAttempts_CheckRequest(bleDeviceAddress_t address)
*\brief        Check if a pairing/peripheral security request should be accepted.
*
*\param  [in]  address    The address of the peer.
*
*\retval       TRUE       If ok.
*\retval       FALSE      If this is a repeated attempt and timeout has not expired.
********************************************************************************** */
STATIC bool_t RepeatedAttempts_CheckRequest(bleDeviceAddress_t address)
{
    bool_t okToProceed = TRUE;
    uint8_t iCount;

