nxp-appcodehub/dm-lvgl-epaper-smartlabel-kw45/k32w148evk_wireless_uart_epaper_freertos/source/common/ble_conn_manager.c
    /*
     * Check if this device has been involved in a failed pairing and is
     * still in the waiting period
     */
    for (iCount = 0; iCount < (uint8_t)gRepeatedAttemptsNoOfDevices_c; iCount++)
    {
        if (FLib_MemCmp(maPairingPeers[iCount].address,
                        address,
                        gcBleDeviceAddressSize_c))
        {
            if (maPairingPeers[iCount].remainingTime != 0U)
            {
                okToProceed = FALSE;
                break;
            }
        }
    }

    return okToProceed;
}

/*! *********************************************************************************
*\private
*\fn           void RepeatedAttempts_LogAttempt(gapPairingCompleteEvent_t *pEvent,
*                                               bleDeviceAddress_t        address)
*\brief        Track a pairing attempt.
*
*\param  [in]  pEvent     Pointer to the pairing complete event.
*\param  [in]  address    Address of the peer.
*
*\retval       void.
********************************************************************************** */
STATIC void RepeatedAttempts_LogAttempt
(
    gapPairingCompleteEvent_t *pEvent,
    bleDeviceAddress_t        address
)
{
    bool_t found = FALSE;
    uint8_t iCount;
    uint8_t emptySlotIndex = 0xFF;
    uint8_t indexToReplace = 0;
    uint16_t maxTimeout = 0;

    /* Stop timer if it is running */
    if ((mRepeatedAttemptsTimerId != gTmrInvalidTimerID_c) &&
        TMR_IsTimerActive(mRepeatedAttemptsTimerId))
    {
        (void)TMR_StopTimer(mRepeatedAttemptsTimerId);
        RepeatedAttempts_UpdateTimePassed(mMinTimeToWait -
                   TMR_GetRemainingTime(mRepeatedAttemptsTimerId)/1000U);
    }

    /* Check if this peer was in the repeated attempts array */
    for (iCount = 0; iCount < (uint8_t)gRepeatedAttemptsNoOfDevices_c; iCount++)
    {
        if (FLib_MemCmp(maPairingPeers[iCount].address,
                        address,
                        gcBleDeviceAddressSize_c))
        {
            found = TRUE;
            if (pEvent->pairingSuccessful == TRUE)
            {
                /* On successful pairing remove device from array */
                FLib_MemSet(&maPairingPeers[iCount],
                            0x00U,
                            sizeof(repeatedAttemptsDevice_t));
            }
            else
            {
                /* On failed pairing, double waiting period */
                maPairingPeers[iCount].baseTimeout = FLib_GetMin(
                                 2U * maPairingPeers[iCount].baseTimeout,
                                 gRepeatedAttemptsTimeoutMax_c);
                maPairingPeers[iCount].remainingTime =
                                 maPairingPeers[iCount].baseTimeout;
            }
            break;
        }

        /* Memorize first empty slot if this peer is a new device which must be added */
        if ((maPairingPeers[iCount].baseTimeout == 0U) &&
            (emptySlotIndex == 0xFF))
        {
            emptySlotIndex = iCount;
        }

        /*
         * Memorize the longest waiting device in the array if this peer
         * is a new device which must be added and the array is full
         */
        if (maPairingPeers[iCount].remainingTime > maxTimeout)
        {
            maxTimeout = maPairingPeers[iCount].remainingTime;
            indexToReplace = iCount;
        }
    }

    /* If this is a new peer add it to the array - replace oldest entry if full */
    if ((found == FALSE) && (pEvent->pairingSuccessful == FALSE))
    {
        uint8_t index;

        if (emptySlotIndex != 0xFF)
        {
            index = emptySlotIndex;
        }
        else
        {
            index = indexToReplace;
        }

        FLib_MemCpy(maPairingPeers[index].address, address, gcBleDeviceAddressSize_c);
        maPairingPeers[index].baseTimeout   = gRepeatedAttemptsTimeoutMin_c;
        maPairingPeers[index].remainingTime = gRepeatedAttemptsTimeoutMin_c;
    }

    /* Restart timer */
    mMinTimeToWait = RepeatedAttempts_GetMinTimeToWait();

    if (mMinTimeToWait < (gRepeatedAttemptsTimeoutMax_c + 1U))
    {
        if (mRepeatedAttemptsTimerId == gTmrInvalidTimerID_c)
        {
            mRepeatedAttemptsTimerId = TMR_AllocateTimer();
        }

        if (mRepeatedAttemptsTimerId != gTmrInvalidTimerID_c)
        {

            (void)TMR_StartLowPowerTimer(mRepeatedAttemptsTimerId,
                                         gTmrLowPowerSingleShotMillisTimer_c,
                                         TmrSeconds(mMinTimeToWait),
                                         RepeatedAttempts_TimerCb,
                                         NULL);
        }
    }
}

/*! *********************************************************************************
*\private
*\fn           void RepeatedAttempts_UpdateTimePassed(uint16_t seconds)
*\brief        Update array waiting times after stopping timer.
*
*\param  [in]  seconds    Seconds to subtract from waiting times.
*
*\retval       void.
********************************************************************************** */
STATIC void RepeatedAttempts_UpdateTimePassed(uint16_t seconds)
{
    uint8_t iCount;

    for (iCount = 0; iCount < (uint8_t)gRepeatedAttemptsNoOfDevices_c; iCount++)
    {
        if (maPairingPeers[iCount].remainingTime > seconds)
        {
            maPairingPeers[iCount].remainingTime -= seconds;
        }
        else
        {
            maPairingPeers[iCount].remainingTime = 0;
        }
    }
}

/*! *********************************************************************************
*\private
*\fn           uint16_t RepeatedAttempts_GetMinTimeToWait(void)
*\brief        Return minimum waiting time from array.
*
*\param  [in]  none.
*
*\return       uint16_t    Minimum remaining wait time in the array.
********************************************************************************** */
STATIC uint16_t RepeatedAttempts_GetMinTimeToWait(void)
{
    uint8_t iCount;
    uint16_t minRemainingTime = gRepeatedAttemptsTimeoutMax_c + 1U;

    for (iCount = 0; iCount < (uint8_t)gRepeatedAttemptsNoOfDevices_c; iCount++)
    {
        if ((maPairingPeers[iCount].remainingTime != 0) &&
            (maPairingPeers[iCount].remainingTime < minRemainingTime))
        {
            minRemainingTime = maPairingPeers[iCount].remainingTime;
        }
    }

    return minRemainingTime;
}

/*! *********************************************************************************
*\private
*\fn           void RepeatedAttempts_TimerCb(void *param)
*\brief        Handles advertising timer callback.
*
*\param  [in]  pParam        Callback parameters.
*
*\retval       void.
********************************************************************************** */
STATIC void RepeatedAttempts_TimerCb(void *param)
{
    RepeatedAttempts_UpdateTimePassed(mMinTimeToWait);

    mMinTimeToWait = RepeatedAttempts_GetMinTimeToWait();

    if (mMinTimeToWait < (gRepeatedAttemptsTimeoutMax_c + 1U))
    {
        (void)TMR_StartLowPowerTimer(mRepeatedAttemptsTimerId,
                                     gTmrLowPowerSingleShotMillisTimer_c,
                                     TmrSeconds(mMinTimeToWait),
                                     RepeatedAttempts_TimerCb,
                                     NULL);
    }
    else
    {
        TMR_FreeTimer(mRepeatedAttemptsTimerId);
        mRepeatedAttemptsTimerId = gTmrInvalidTimerID_c;
    }
}
#endif /* gRepeatedAttempts_d */

/*! *********************************************************************************
* @}
********************************************************************************** */
